ninty_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "name" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["birth_date", "2022-06-04"], ["name", "p"], ["description", "  \r\n                hiiii\r\n                "], ["updated_at", "2022-08-28 18:26:26.556763"], ["id", 2]]
---
      def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)